In [2]:
import os
import pandas as pd
from datetime import date, timedelta, datetime
from sqlalchemy import create_engine, text
from pandas.tseries.offsets import BDay

engine = create_engine('mysql+pymysql://root:@localhost:3306/portfolio_development')
conpf = engine.connect()
engine = create_engine("mysql+pymysql://root:@localhost:3306/stock")
const = engine.connect()
engine = create_engine("sqlite:///c:\\ruby\\port_lite\\db\\development.sqlite3")
conlite = engine.connect()

In [6]:
today = date.today()
# convert the timedelta object to a BusinessDay object
num_business_days = BDay(1)
yesterday = today - num_business_days
yesterday = yesterday.date()
print(f'today: {today}')
print(f'yesterday: {yesterday}')

today: 2025-08-22
yesterday: 2025-08-21

In [8]:
# Get the user's home directory
user_path = os.path.expanduser('~')
# Get the current working directory
current_path = os.getcwd()
# Derive the base directory (base_dir) by removing the last folder ('Daily')
base_path = os.path.dirname(current_path)
#C:\Users\PC1\OneDrive\A5\Data
dat_path = os.path.join(base_path, "Data")
#C:\Users\PC1\Downloads\Datasets
dts_path = os.path.join(user_path, "Downloads", "Datasets")
#C:\Users\PC1\OneDrive\Imports\santisoontarinka@gmail.com - Google Drive\Data>
god_path = os.path.join(user_path, "OneDrive","Imports","santisoontarinka@gmail.com - Google Drive","Data")
#C:\Users\PC1\iCloudDrive\data
icd_path = os.path.join(user_path, "iCloudDrive", "Data")
#C:\Users\PC1\OneDrive\Documents\obsidian-git-sync\Data
osd_path = os.path.join(user_path, "OneDrive","Documents","obsidian-git-sync","Data")
#C:\Users\PC1\OneDrive\A5\Excel
xsl_path = os.path.join(base_path, "Excel")

In [10]:
print("User path:", user_path)
print(f"Current path: {current_path}")
print(f"Base path: {base_path}")
print(f"Data path (dat_path): {dat_path}") 
print(f"Excel path (xsl_path): {xsl_path}") 
print(f"Google Drive path (god_path): {god_path}")
print(f"iCloudDrive path (icd_path): {icd_path}") 
print(f"Obsidian path (osd_path): {osd_path}")

User path: C:\Users\PC1
Current path: C:\Users\PC1\OneDrive\A5\Daily
Base path: C:\Users\PC1\OneDrive\A5
Data path (dat_path): C:\Users\PC1\OneDrive\A5\Data
Excel path (xsl_path): C:\Users\PC1\OneDrive\A5\Excel
Google Drive path (god_path): C:\Users\PC1\OneDrive\Imports\santisoontarinka@gmail.com - Google Drive\Data
iCloudDrive path (icd_path): C:\Users\PC1\iCloudDrive\Data
Obsidian path (osd_path): C:\Users\PC1\OneDrive\Documents\obsidian-git-sync\Data

### Tables in the process

In [13]:
format_dict = {
    'shares':'{:,}',    
    'price':'{:.2f}',
    'dividend':'{:.4f}', 
    'date':'{:%Y-%m-%d}', 
    
    'qty':'{:,}','shares':'{:,}',
    'price':'{:.2f}','buy_price':'{:.2f}',
    'dividend':'{:.4f}',    
    'fee':'{:,.2f}','vat':'{:,.2f}','net':'{:,.2f}',
  
    'days':'{:,}',
    'price':'{:.2f}',
    'fee':'{:,.2f}','vat':'{:,.2f}','net':'{:,.2f}','profit':'{:,.2f}',
    'percent':'{:,.2f}%','yearly':'{:,.2f}%',   
    
    'shares':'{:,}',    
    'q4':'{:.4f}','q3':'{:.4f}','q2':'{:.4f}','q1':'{:.4f}','dividend':'{:.4f}',
    'xdate':'{:%Y-%m-%d}','paiddate':'{:%Y-%m-%d}',
    
    'qty':'{:,}','available_qty':'{:,}',
    'cost':'{:.2f}','max_price':'{:.2f}','min_price':'{:.2f}','buy_target':'{:.2f}','sell_target':'{:.2f}',
    'volume':'{:,.2f}','beta':'{:,.2f}',
    
    'qty':'{:,}','available_qty':'{:,}',
    'cost':'{:.2f}','max_price':'{:.2f}','min_price':'{:.2f}','buy_target':'{:.2f}','sell_target':'{:.2f}',
    'volume':'{:,.2f}','beta':'{:,.2f}',
    }

In [15]:
def show_buy(const, name):
    sql = """
    SELECT * 
    FROM buy 
    WHERE name = '{}'
    """.format(name)
    
    df_buy = pd.read_sql(sql, const)
    df_buy.drop(['volsell', 'volbal','dividend'], axis=1, inplace=True)
    df_buy.rename(columns={'volbuy':'shares'},inplace=True)
    df_buy['shares'] = df_buy['shares'].astype('int64')
    return df_buy.style.format(format_dict)

In [17]:
def show_dividend(const, name):
    sql = """
    SELECT * 
    FROM dividend 
    WHERE name = '{}'
    """.format(name)
    
    df_dividend = pd.read_sql(sql, const)
    df_dividend.drop(['PRICE', 'PERCENT'], axis=1, inplace=True)
    df_dividend.columns = df_dividend.columns.str.lower()
    df_dividend['shares'] = df_dividend['shares'].astype('int64')
    df_dividend['xdate'] = pd.to_datetime(df_dividend['xdate'])
    df_dividend['paiddate'] = pd.to_datetime(df_dividend['paiddate'])
    return df_dividend.style.format(format_dict)

In [19]:
def show_stocks(conlite, name):
    sql = """
    SELECT * 
    FROM stocks 
    WHERE name = '{}'
    """.format(name)
    
    df_stocks = pd.read_sql(sql, conlite)
    return df_stocks.style.format(format_dict)

In [35]:
def update_buy(const, name, new_qty, new_price):
    # Extract scalar values from Pandas Series
    new_qty_value = int(new_qty.iloc[0])
    
    # Use parameterized query to avoid SQL injection
    sqlUpd = text("""
        UPDATE buy
        SET volbuy = :new_qty,
        price = :new_price
        WHERE name = :name
    """)
    
    # Execute the query with parameters
    result = const.execute(sqlUpd, {
        'new_qty': new_qty_value,
        'new_price': new_price,
        'name': name
    })

    return f"Records updated = {result.rowcount}"

In [39]:
def update_buy(const, name, new_qty, new_price):
    # Use parameterized query to avoid SQL injection
    sqlUpd = text("""
        UPDATE buy
        SET volbuy = :new_qty,
        price = :new_price
        WHERE name = :name
    """)
    
    # Execute the query with parameters
    result = const.execute(sqlUpd, {
        'new_qty': new_qty,
        'new_price': new_price,
        'name': name
    })

    return f"Records updated = {result.rowcount}"

In [50]:
def update_dividend(const, name, new_qty):
    # Extract scalar values from Pandas Series
    new_qty_value = new_qty  
    # Use parameterized query to avoid SQL injection
    sqlUpd = text("""
        UPDATE dividend
        SET shares = :new_qty
        WHERE name = :name
    """)
    
    # Execute the query with parameters
    result = const.execute(sqlUpd, {
        'new_qty': new_qty_value,  # Use the scalar value
        'name': name
    })

    return f"Records updated = {result.rowcount}"

In [58]:
def update_stock(conlite, name, new_qty, new_unit_cost, new_buy_target, new_sell_target, new_buy_qty):
    # Extract scalar values from Pandas Series
    new_qty_value = int(new_qty)
    new_unit_cost_value = float(new_unit_cost)   
    # Use parameterized query to avoid SQL injection
    sqlUpd = text("""
        UPDATE stocks
        SET available_qty = :new_qty, 
            cost = :new_unit_cost,
            buy_target = :new_buy_target,
            sell_target = :new_sell_target,    
            qty = :new_buy_qty
        WHERE name = :name
    """)    
    # Execute the query with parameters
    result = conlite.execute(sqlUpd, {
        'new_qty': new_qty_value,  # Use the scalar value
        'new_unit_cost': new_unit_cost_value, # Use the scalar value 
        'new_buy_target': new_buy_target,
        'new_sell_target': new_sell_target,     
        'new_buy_qty': new_buy_qty,
        'name': name
    })
    return f"Records updated = {result.rowcount}"

### End of Definition

In [72]:
# Sells table in MySQL portfolio database
sql = """
SELECT name, stock_id, B.date AS buy_date, qty, B.price AS buy_price, S.* 
FROM sells S
JOIN buys B ON S.buy_id = B.id
JOIN stocks T ON B.stock_id = T.id
ORDER BY S.id DESC
LIMIT 1"""
df_sells_latest = pd.read_sql(sql, conpf)
df_sells_latest.style.format(format_dict)

### In case of sale, retreive buy id from sells record (buy_id)

In [92]:
# Buys table in MySQL portfolio database
transaction = 'S'

names = df_sells_latest['name']
name = names.to_string(index=False)
name

'CPF'

In [108]:
sr_qty = df_sells_latest['qty']
qty = sr_qty.to_string(index=False)
qty = int(qty) * -1

sr_price = df_sells_latest['buy_price']
buy_price = sr_price.to_string(index=False)
buy_price = float(buy_price)

sr_price = df_sells_latest['price']
sell_price = sr_price.to_string(index=False)
sell_price = float(sell_price)

buy_ids = df_sells_latest['buy_id']
buy_id = buy_ids.to_string(index=False)

sql = """
SELECT name, B.* 
FROM buys B
JOIN stocks T 
ON B.stock_id = T.id
WHERE B.id = %s
"""
sql = sql % buy_id
print(sql)

df_buys_latest = pd.read_sql(sql, conpf)
df_buys_latest.style.format(format_dict)

SELECT name, B.*
FROM buys B
JOIN stocks T
ON B.stock_id = T.id
WHERE B.id = 1342

In [110]:
transaction, name, qty, sell_price, buy_price

('B', 'CPF', -5000, 24.3, 24.1)

### In case of buy, retreive buy id from latest buy record (id)

In [23]:
sql = """
SELECT name, B.* 
FROM buys B
JOIN stocks T 
ON B.stock_id = T.id
ORDER BY id DESC
LIMIT 1
"""
print(sql)
df_buys_latest = pd.read_sql(sql, conpf)
df_buys_latest.style.format(format_dict)

SELECT name, B.*
FROM buys B
JOIN stocks T
ON B.stock_id = T.id
ORDER BY id DESC
LIMIT 1

In [104]:
transaction = 'B'

names = df_buys_latest['name']
name = names.to_string(index=False)

sr_qty = df_buys_latest['qty']
qty = sr_qty.to_string(index=False)
qty = int(qty)

sr_price = df_buys_latest['price']
buy_price = sr_price.to_string(index=False)
buy_price = float(buy_price)

transaction, name, qty, buy_price

('B', 'CPF', 5000, 24.1)

## Begin of Sale transaction

### Begin of Update buy table in MySQL stock database from sale transaction

In [125]:
old_qty = df_buys_latest['qty']
old_qty

0    5000
Name: qty, dtype: int64

In [127]:
new_qty = old_qty + qty
print(new_qty)

0    0
Name: qty, dtype: int64

In [129]:
show_buy(const, name)

In [137]:
buy_price = 24.1
buy_price

24.1

In [139]:
print(transaction, name, new_qty, buy_price)

B CPF 0    0
Name: qty, dtype: int64 24.1

In [143]:
# Example usage
update_buy(const, name, new_qty, buy_price)

'Records updated = 1'

In [145]:
show_buy(const, name)

In [37]:
# Define the SQL query
sqlDel = text("""
    DELETE FROM buy
    WHERE name = :name AND volbuy = 0;
""")

# Execute the query with the correct parameter dictionary
result = const.execute(sqlDel, {'name': name})

# Print the number of rows deleted
print(f"Records deleted: {result.rowcount}")

Records deleted: 1

### End of Update buy table in MySQL stock database from sale transaction

### Begin of Update dividend table in MySQL stock database from sale transaction

In [147]:
show_dividend(const, name)

In [149]:
print(new_qty)

0    0
Name: qty, dtype: int64

In [151]:
update_dividend(const, name, new_qty)

'Records updated = 1'

In [45]:
# Define the SQL query
sqlDel = text("""
    DELETE FROM dividend
    WHERE name = :name AND shares = 0;
""")

# Execute the query with the correct parameter dictionary
result = const.execute(sqlDel, {'name': name})

# Print the number of rows deleted
print(f"Records deleted: {result.rowcount}")

Records deleted: 0

In [153]:
show_dividend(const, name)

### End of Update dividend table in MySQL stock database from sale transaction

### Begin of Update stocks table in SQLite port_lite database from sale transaction

In [155]:
show_stocks(conlite, name)

In [159]:
# Extract scalar values from Pandas Series (if applicable)
new_qty_value = new_qty.iloc[0] if hasattr(new_qty, 'iloc') else new_qty
#cost_value = cost.iloc[0] if hasattr(cost, 'iloc') else cost
# Print the values
print(name, transaction, new_qty_value, buy_price)

CPF B 0 24.1

In [102]:
#print("Raw cost value before extraction:", cost)

In [104]:
def update_stock(conlite, name, new_qty, new_price):
    # Extract scalar values from Pandas Series
    new_qty_value = int(new_qty.iloc[0])  
    # Use parameterized query to avoid SQL injection
    sqlUpd = text("""
        UPDATE stocks
        SET available_qty = :new_qty,
        cost = :new_price
        WHERE name = :name
    """)    
    # Execute the query with parameters
    result = conlite.execute(sqlUpd, {
        'new_qty': new_qty_value, # Use the scalar value
        'new_price': new_price,
        'name': name
    })
    return f"Records updated = {result.rowcount}"

In [ ]:
new_buy_target = 24.1
new_sell_target = 24.3
new_buy_qty = 5000

In [167]:
print(new_qty, buy_price, new_buy_target, new_sell_target, new_buy_qty)

0    0
Name: qty, dtype: int64 24.1 24.1 24.3 5000

In [169]:
# Example usage
update_stock(conlite, name, new_qty, buy_price, new_buy_target, new_sell_target, new_buy_qty)

C:\Users\PC1\AppData\Local\Temp\ipykernel_218744\2826900856.py:3: FutureWarning: Calling int on a single element Series is deprecated and will raise a TypeError in the future. Use int(ser.iloc[0]) instead
  new_qty_value = int(new_qty)

'Records updated = 1'

In [171]:
show_stocks(conlite, name)

In [103]:
# Define the SQL query
sqlDel = text("""
    DELETE FROM stocks
    WHERE name = :name AND available_qty = 0;
""")

# Execute the query with the correct parameter dictionary
result = conlite.execute(sqlDel, {'name': name})

# Print the number of rows deleted
print(f"Records deleted: {result.rowcount}")

Records deleted: 0

### End of Update stocks table in SQLite port_lite database from sale transaction

## End of Sale process

### =====================================================

## Begin of  Buy process

### Begin of Update buy table in MySQL database from buy transaction

In [27]:
sql = """
SELECT *, volbuy * price AS cost_amt 
FROM buy
WHERE name = '%s'
"""
sql = sql % name
print(sql)

df_buy = pd.read_sql(sql, const)
df_buy['date'] = pd.to_datetime(df_buy['date'])
df_buy.drop(['volsell', 'volbal'], axis=1, inplace = True)
df_buy.rename(columns={'volbuy':'shares'}, inplace = True)
df_buy['shares'] = df_buy['shares'].astype('int64')
df_buy

SELECT *, volbuy * price AS cost_amt
FROM buy
WHERE name = 'CPF'

  name       date  shares  price  active  dividend period grade  cost_amt
0  CPF 2025-08-21       0   24.1       1      1.55      4    A1       0.0

In [29]:
print(transaction, name, qty, buy_price)

B CPF 5000 24.1

In [32]:
#new_unit_cost = df_buy['cost_amt'].iloc[0] + (qty * buy_price)
new_unit_cost = 24.10
#new_qty = df_buy['shares'].iloc[0] + qty
new_qty = 4_000
print(new_unit_cost)
print(new_qty)
#new_unit_cost = new_unit_cost / new_qty
#print(new_unit_cost)

24.1
4000

### In case there is the same stock name in port

In [41]:
update_buy(const, name, qty, buy_price)

'Records updated = 1'

In [43]:
show_buy(const, name)

### In case of totally new stock

In [36]:
rcd = {
    'name': 'CPF',
    'date': '2025-08-21',
    'volbuy': 4000,
    'price': 24.1,
    'volsell': 0,
    'volbal': 0,
    'active': 1,
    'dividend': 0,
    'period': 4,
    'grade': 'A1'
}
sqlIns = text("""
INSERT INTO buy (name, date, volbuy, price, volsell, volbal, active, dividend, period, grade)
VALUES (:name, :date, :volbuy, :price, :volsell, :volbal, :active, :dividend, :period, :grade)
""")
result = const.execute(sqlIns, rcd)
result.rowcount

1

In [68]:
#name = 'CPF'

In [80]:
show_buy(const, name)

### End of Update buy table in MySQL database from buy transaction

### Begin of Update dividend table in MySQL stock database from buy transaction

In [46]:
show_dividend(const, name)

In [52]:
update_dividend(const, name, qty)

'Records updated = 1'

### In case of totally new dividend

In [75]:
rcd = ['CPF', 0.0, 0, 1.00, 0, 100, 4000, '2023-08-29', '2023-09-12', '', 1]
rcd

['CPF', 0.0, 0, 1.0, 0, 100, 4000, '2023-08-29', '2023-09-12', '', 1]

In [87]:
rcd = {
    'name': 'CPF',
    'q4': '0',
    'q3': '0',
    'q2': '1.00',
    'q1': '0',    
    'dividend': '1.00',      
    'shares': 4000,
    'xdate': '2025-08-29',
    'paiddate': '2025-09-12',
    'kind': ' ',
    'actual': 1
}
sqlIns = text("""
INSERT INTO dividend (name, q4, q3, q2, q1, dividend, shares, xdate, paiddate, kind, actual)
VALUES (:name, :q4, :q3, :q2, :q1, :dividend, :shares, :xdate, :paiddate, :kind, :actual)
""")
print(sqlIns)

INSERT INTO dividend (name, q4, q3, q2, q1, dividend, shares, xdate, paiddate, kind, actual)
VALUES (:name, :q4, :q3, :q2, :q1, :dividend, :shares, :xdate, :paiddate, :kind, :actual)

In [89]:
result = const.execute(sqlIns, rcd)
result.rowcount

1

In [54]:
show_dividend(const, name)

### End of Create dividend table in MySQL stock database from buy transaction

### Begin of Update stocks table in SQLite port_lite database from buy transaction

In [60]:
show_stocks(conlite, name)

In [62]:
#
new_buy_target = 24.1
new_sell_target = 24.30
new_buy_qty = 5_000
print(transaction, name, qty, buy_price, new_buy_target, new_sell_target, new_buy_qty)

B CPF 5000 24.1 24.1 24.3 5000

In [68]:
# Example usage
update_stock(conlite, name, qty, buy_price, new_buy_target, new_sell_target, new_buy_qty)

'Records updated = 1'

In [70]:
show_stocks(conlite, name)

### End of Update stocks table in SQLite port_lite database from buy transaction

## End of  Buy process

### =================================================

In [173]:
#price_date = '2025-02-14'
sql = "SELECT period, buy.grade AS grade, buy.name AS name, buy.date AS date, \
FORMAT(volbuy,0) AS volbuy, FORMAT(buy.price,2) AS buy_price, price.price AS mkt_price,\
FORMAT((volbuy * buy.price),2) AS amtbuy, FORMAT((volbuy * price.price),2) AS amtmkt, \
FORMAT(((price.price - buy.price) * volbuy),2) AS amtpol, \
FORMAT((((price.price - buy.price)*volbuy)/(volbuy*buy.price)*100),2) AS pctpol \
FROM buy INNER JOIN price ON buy.name = price.name WHERE price.date = '{}' \
ORDER BY period, buy.name".format(yesterday)
print(sql)

SELECT period, buy.grade AS grade, buy.name AS name, buy.date AS date, FORMAT(volbuy,0) AS volbuy, FORMAT(buy.price,2) AS buy_price, price.price AS mkt_price,FORMAT((volbuy * buy.price),2) AS amtbuy, FORMAT((volbuy * price.price),2) AS amtmkt, FORMAT(((price.price - buy.price) * volbuy),2) AS amtpol, FORMAT((((price.price - buy.price)*volbuy)/(volbuy*buy.price)*100),2) AS pctpol FROM buy INNER JOIN price ON buy.name = price.name WHERE price.date = '2025-08-21' ORDER BY period, buy.name

In [175]:
df_buy = pd.read_sql(sql, const)
df_buy

,period,grade,name,date,volbuy,buy_price,mkt_price,amtbuy,amtmkt,amtpol,pctpol
0,1,C1,AH,2023-06-08,"1,200",37.00,14.80,"44,400.00","17,760.00","-26,640.00",-60.00
1,1,A1,AWC,2023-06-15,"9,000",4.96,2.40,"44,640.00","21,600.00","-23,040.00",-51.61
2,1,A2,JMART,2023-01-20,"6,800",33.00,8.45,"224,400.00","57,460.00","-166,940.00",-74.39
3,1,C2,ORI,2022-04-07,"50,000",9.00,2.26,"450,000.00","113,000.00","-337,000.00",-74.89
4,1,C2,PTTGC,2021-03-17,"6,000",64.75,28.00,"388,500.00","168,000.00","-220,500.00",-56.76
5,1,C2,SCC,2021-09-20,600,405.00,227.00,"243,000.00","136,200.00","-106,800.00",-43.95
6,1,A3,SINGER,2023-01-19,"6,000",24.80,5.30,"148,800.00","31,800.00","-117,000.00",-78.63
7,2,A1,AIMIRT,2023-08-17,"17,500",10.60,9.60,"185,500.00","168,000.00","-17,500.00",-9.43
8,2,C1,CPNREIT,2022-08-16,"55,000",18.00,11.40,"990,000.00","627,000.00","-363,000.00",-36.67
9,2,C1,DIF,2020-08-01,"50,000",12.17,8.20,"608,500.00","410,000.00","-198,500.00",-32.62
10,2,C1,GVREIT,2022-08-24,"69,000",7.75,6.35,"534,750.00","438,150.00","-96,600.00",-18.06
11,2,A4,MCS,2016-09-20,"81,000",14.80,8.60,"1,198,800.00","696,600.00","-502,200.00",-41.89
12,2,A1,NER,2021-09-01,"27,000",7.45,4.30,"201,150.00","116,100.00","-85,050.00",-42.28
13,2,A2,PTT,2025-08-08,"2,500",32.00,32.00,"80,000.00","80,000.00",0.00,0.00
14,2,B1,SENA,2022-03-29,"105,000",4.48,1.85,"470,400.00","194,250.00","-276,150.00",-58.71
15,2,C1,TFFIF,2023-07-06,"20,000",7.20,6.05,"144,000.00","121,000.00","-23,000.00",-15.97
16,2,B1,WHAIR,2021-10-11,"50,000",8.70,5.35,"435,000.00","267,500.00","-167,500.00",-38.51
17,2,C1,WHART,2022-01-05,"25,000",11.60,9.05,"290,000.00","226,250.00","-63,750.00",-21.98
18,3,A3,3BBIF,2018-05-17,"120,000",10.10,6.20,"1,212,000.00","744,000.00","-468,000.00",-38.61
19,3,B3,BCH,2021-09-07,"4,000",21.70,13.40,"86,800.00","53,600.00","-33,200.00",-38.25
20,3,C3,IVL,2022-08-29,"7,200",40.00,23.50,"288,000.00","169,200.00","-118,800.00",-41.25
21,3,A3,RCL,2021-11-08,"27,000",38.80,27.25,"1,047,600.00","735,750.00","-311,850.00",-29.77
22,3,A4,STA,2021-06-15,"10,000",30.00,12.00,"300,000.00","120,000.00","-180,000.00",-60.00
23,3,A1,SYNEX,2022-01-07,"17,500",26.40,11.50,"462,000.00","201,250.00","-260,750.00",-56.44
24,3,A4,TVO,2024-11-06,"8,000",24.00,25.25,"192,000.00","202,000.00","10,000.00",5.21
25,4,A1,CPF,2025-08-21,0,24.10,24.40,0.00,0.00,0.00,None
26,4,C3,JMT,2023-01-26,"4,200",55.50,11.40,"233,100.00","47,880.00","-185,220.00",-79.46
27,4,B2,PTG,2023-07-12,"3,600",11.40,7.00,"41,040.00","25,200.00","-15,840.00",-38.60
28,4,C1,TOA,2023-09-06,"1,000",26.00,14.40,"26,000.00","14,400.00","-11,600.00",-44.62

In [177]:
file_name = 'portfolio.csv'
output_file = os.path.join(dat_path, file_name)
god_file = os.path.join(god_path, file_name)
icd_file = os.path.join(icd_path, file_name)
osd_file = os.path.join(osd_path, file_name)

In [ ]:
print(f"Output file : {output_file}") 
print(f"icd_file : {icd_file}") 
print(f"god_file : {god_file}") 
print(f"osd_file : {osd_file}")

In [120]:
df_buy.to_csv(output_file, header=True, index=False)
df_buy.to_csv(icd_file, header=True, index=False)
df_buy.to_csv(god_file, header=True, index=False)
df_buy.to_csv(osd_file, header=True, index=False)

In [122]:
file_name = '035-portfolio.xlsx'
xsl_file = os.path.join(xsl_path, file_name)

df_buy.to_excel(xsl_file, index=False)